tap "heroku/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Database migrations CLI tool
brew "golang-migrate"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Text-to-HTML conversion tool
brew "markdown"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@17"
# Develop and deploy code with zero configuration
brew "railway"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Customize your Claude Code themes, thinking verbs, and more
brew "tweakcc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# ASGI web server
brew "uvicorn"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-geist"
cask "font-geist-mono"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# Keyboard customiser
cask "karabiner-elements"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/j178/leetgo"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-edit"
cargo "prs"
cargo "tokei"
