tap "heroku/brew"
tap "laishulu/homebrew"
tap "oven-sh/bun"
brew "xz"
brew "zstd"
brew "bat"
brew "cmake"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "golang-migrate"
brew "htop"
brew "imagemagick"
brew "jaq"
brew "neovim"
brew "node"
brew "postgresql@18", restart_service: :changed
brew "railway"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "tldr"
brew "tree"
brew "uv"
brew "wget"
brew "xh"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "heroku/brew/heroku"
brew "laishulu/homebrew/macism"
brew "oven-sh/bun/bun"
cask "docker-desktop"
cask "font-geist"
cask "font-geist-mono"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "karabiner-elements"
cask "malwarebytes"
cask "ngrok"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/daixiang0/gci"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/suzuki-shunsuke/pinact/v3/cmd/pinact"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-audit"
cargo "cargo-edit"
cargo "cargo-outdated"
cargo "prs"
cargo "tokei"
